Revit 2016 API
Face.Reference Property
Returns a stable reference to the face.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Syntax
C#
public Reference Reference { get; }
Visual Basic
Public ReadOnly Property Reference As Reference
	Get
Visual C++
public:
property Reference^ Reference {
	Reference^ get ();
}
Remarks
This value is if the corresponding geometry object does not permit referencing.
See Also
Face Class
Autodesk.Revit.DB Namespace